Catalogs/ОбъектыСВнешнимФайловымХранением.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбъектыСВнешнимФайловымХранением</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОбъектыСВнешнимФайловымХранением/Ext/ManagerModule.bsl
Функция ПрименимоКОбъекту(СсылкаНаОбъект) Экспорт
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		ТипОбъекта = "Справочники";
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		ТипОбъекта = "Документы";
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	ИмяОбъекта = СсылкаНаОбъект.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыСВнешнимФайловымХранением.Использовать,
	|	ОбъектыСВнешнимФайловымХранением.Код
	|ИЗ
	|	Справочник.ОбъектыСВнешнимФайловымХранением КАК ОбъектыСВнешнимФайловымХранением
	|ГДЕ
	|	ОбъектыСВнешнимФайловымХранением.ТипОбъекта = &ТипОбъекта
	|	И ОбъектыСВнешнимФайловымХранением.ИмяОбъекта = &ИмяОбъекта";
	
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() > 0  Тогда
		Возврат РезультатЗапроса.Использовать;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
КонецФункции
